{"name":"Khodal Jid","headerTaglineOne":"HOLA AMIGO!👋","headerTaglineTwo":"Khodal Jid This side,","headerTaglineThree":"\"Crafting Solutions, Enhancing Experiences: A Journey in Computer Systems and Cloud Infrastructure\"","headerTaglineFour":"I am from Waterloo Ontario","showCursor":true,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/Khodal09"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/khodal-jid"},{"id":"5","title":"Email","link":"mailto: jidkhodal@gmail.com"}],"projects":[],"services":[],"aboutpara":"Hello! I'm Khodal Jid, an enthusiastic and dedicated Computer Systems Technician with a robust background in network troubleshooting, IT infrastructure management, and cloud infrastructure solutions. Currently, I am pursuing my studies at Conestoga College, where I have consistently excelled academically, achieving a 3.9 GPA and earning recognition for my involvement in various projects and volunteer activities.","resume":{"tagline":"I am Computer Systems Technician IT Infrastructure Student, Crafting Solutions, Enhancing Experiences: A Journey in Computer Systems and Cloud Infrastructure\"","description":"Welcome to my portfolio! I am Khodal Jid, an experienced Computer Systems Technician with a passion for network troubleshooting, IT infrastructure management, and cloud solutions. With a proven track record in leadership roles and a commitment to optimizing customer experiences, I specialize in high-end PC and network operations. As a dedicated student at Conestoga College, I have excelled academically, maintaining a 3.9 GPA while actively participating in various projects and volunteer work.\n\nExplore my portfolio to learn more about my journey, including my key projects like network stabilization and inventory management at the VARLab, my role in enhancing internet speeds, and my contributions to the Esports Hub. Discover how my skills in Cisco, Palo Alto, VMware, AWS, and more can bring innovative solutions to your organization. Let’s connect and explore how I can help you achieve your goals in the ever-evolving field of IT and cloud infrastructure.","experiences":[{"id":"1","dates":"Jan 2024- April 2024","type":"Full Time","position":"Digital Learning Simulations IT Support Technician Specialist","bullets":"Re-Inventory Project: Streamlined inventory of 4 rooms, enhancing space  efficiency and accessibility. • Network Enhancement: Boosted VARLab internet speed from 25 Mbps to  900 Mbps by installing switches, hubs, and crafting 30 custom Cat5E/Cat6  cables. • Documentation & Support: Created comprehensive support materials,  improving user experience and technical issue resolution. • Collaboration: Worked closely with development teams to support AR/VR  hardware and software deployment."},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"April 2023- Jan 2024","type":"Part-Time","position":"Esports Hub Lead","bullets":"After being promoted from the role of Esports Event Coordinator now I was  given a role in the Event team of the Hub Leads.  • My core duties were all the duties of the hub lead with event management  additionally. • Provided customer experience to the students who visited hub for gaming and  recreational activities. • Knowledge of High-end PC’s, Consoles, Network Management and other  technical difficulties. • Showed skills like Leadership, Responsibility, Communication, and Friendly  behavior."},{"id":"5c9b46ab-a4ff-474b-b6e5-69f18ada3393","dates":"Jan 2023- April 2023","type":"Part-Time","position":"Esports Event Coordinator ","bullets":"Planned, advertised, and executed 100+ gaming events.  • Creative discussions with the Manager for different and new gaming events  for the Esports community at the college. • Planned and executed events like one which was for a social media campaign  of the Esports hub social media handles."}],"education":{"universityName":"Conestoga College","universityDate":"Sept 2022- Aug 2024","universityPara":"Scored 3.9 GPA overall.  • Expected date of graduation: August 2024 • Face of my course due to a volunteering I was selected to represent the course and my posters  were on the streets all around the city and on most of the campuses of Conestoga College. "},"languages":["Javascript","CSS","Python"],"frameworks":[],"others":["Cisco ","AWS","Photo Model, Conestoga college 2023  • Volunteered as the face of the course for a photoshoot and got selected even my photos were posted on Conestoga college Instagram page and banners around 3 cities Kitchener Waterloo  and Cambridge https://www.instagram.com/p/CqkzPU7sMXl/?igshid=MWZjMTM2ODFkZg== https://www.instagram.com/p/Cpcz3MougDe/?igshid=MWZjMTM2ODFkZg==","Esports Model, Esports Hub Conestoga College 2023  • I was a model for an Esports video and Photo shoot. Additionally, I gave an interview which  was aired on CTV News on behalf of Esports Hub."]}}